/*
 *
 *-----------------------------------------------------------------------------
 * @Name：    028.c
 * @Desc:     
 * @Author:   liangz.org@gmail.com
 * @Create:   2020.07.08   9:24
 *-----------------------------------------------------------------------------
 * @Change:   2020.07.08
 *-----------------------------------------------------------------------------
*/

/*
 * 28.回文数
 */

#include <stdio.h>

int main() {
    int m[16], n, i, t, count = 0;
    long unsigned a, k;
    printf("  No.     number    it's square(palindrome)\n");
    for (n = 1; n < 256; n++) {
        k = 0;
        t = 1;
        a = n * n;
        for (i = 1; a != 0; i++) {
            m[i] = a % 10;
            a /= 10;
        }
        for (; i > 1; i--) {
            k += m[i - 1] * t;
            t *= 10;
        }
        if (k == n * n)
            printf("  %2d %10d %10d\n", ++count, n, n * n);
    }
}

