/*
 *"""
 *-----------------------------------------------------------------------------
 * @Name：    006.h
 * @Desc:     
 * @Author:   liangz.org@gmail.com
 * @Create:   2020.06.22   9:18
 *-----------------------------------------------------------------------------
 * @Change:   2020.06.22
 *-----------------------------------------------------------------------------
*/

/*
 * 高次方数的尾数
 * 求13的13次方的最后三位数。
 */

#include <stdio.h>

int main() {
    int i, x, y, last = 1;
    printf("Input X and Y (X**Y): ");
    scanf("%d**%d", &x, &y);
    for (i = 1; i <= y; i++) {
        last = last * x % 1000;
    }
    printf("The last 3 digits of %d**%d is: %d\n", x, y, last % 1000);
    return 0;
}

