/*
 *
 *-----------------------------------------------------------------------------
 * @Name：    015.h
 * @Desc:     
 * @Author:   liangz.org@gmail.com
 * @Create:   2020.07.02   9:22
 *-----------------------------------------------------------------------------
 * @Change:   2020.07.02
 *-----------------------------------------------------------------------------
*/

/*
 * 15.捕鱼和分鱼
 * A、B、C、D、E五人在某天夜里合伙去捕鱼，到第二天凌晨是都疲惫不堪，于是各自找地方
 * 睡觉。日上三竿，A第一个醒来，他将鱼分为五份，把多余的一条鱼扔掉，拿走自己的一份.
 * B第二个醒来，也将鱼分为五份，把多余的一条鱼扔掉，拿走自己的一份。C、D、E依次醒
 * 来，也按照同样的方法那鱼。问他们合伙至少捕了多少条鱼？
 */


#include <stdio.h>

int main() {
    int n, i, x, flag = 1;
    for (n = 6; flag; n++) {
        for (x = n, i = 1 && flag; i <= 5; i++) {
            if ((x - 1) % 5 == 0)
                x = 4 * (x - 1) / 5;
            else flag = 0;
        }
        if (flag)
            break;
        else
            flag = 1;
    }
    printf("Total number of fish catched = %d\n", n);
}
