/*
 *"""
 *-----------------------------------------------------------------------------
 * @Name：    005.h
 * @Desc:     
 * @Author:   liangz.org@gmail.com
 * @Create:   2020.06.22   9:08
 *-----------------------------------------------------------------------------
 * @Change:   2020.06.22
 *-----------------------------------------------------------------------------
*/

/*
 * 求最大约数
 * 问555555的约数中最大的三位数是多少？
 */

#include <stdio.h>


int main() {
    long i;
    int j;
    printf("Please input number: ");
    scanf("%ld", &i);
    for (j = 999; j >= 100; j--) {
        if (i % j == 0) {
            printf("The max factor with 3 digits in %ld is: %d.\n", i, j);
            break;
        }
    }
}

