/*
 *
 *-----------------------------------------------------------------------------
 * @Name：    008.h
 * @Desc:     
 * @Author:   liangz.org@gmail.com
 * @Create:   2020.06.23   9:20
 *-----------------------------------------------------------------------------
 * @Change:   2020.06.23
 *-----------------------------------------------------------------------------
*/

/*
 * 借书方案知多少
 *
 * 小明有五本新书，要借给A、B、C三位小朋友，若没人每次只能借一本，则可以
 * 有多少种不同的借法？
 */


#include <stdio.h>

int main() {
    int a, b, c, count = 0;
    printf("There are different methods for XM to distribute books to "
           "3 readers: \n");
    for (a = 1; a <= 5; a++) {
        for (b = 1; b <= 5; b++) {
            for (c = 1; a != b && c <= 5; c++) {
                if (c != a && c != b)
                    printf(count % 8 ? "%2d:%d, %d, %d " : "%2d:%d, %d, %d \n",
                       ++count, a, b, c);
            }
        }
    }
}
