/*
 *
 *-----------------------------------------------------------------------------
 * @Name：    036.c
 * @Desc:     
 * @Author:   liangz.org@gmail.com
 * @Create:   2020.07.09   9:51
 *-----------------------------------------------------------------------------
 * @Change:   2020.07.09
 *-----------------------------------------------------------------------------
*/

/*
 * 36.百钱百鸡问题
 */


#include <stdio.h>

int main() {
    int x, y, z, j = 0;
    printf("Following are possible plans to buy 100 fowls with 1000 Yuan.\n");
    for (x = 0; x <= 20; x++)
        for (y = 0; y <= 33; y++) {
            z = 100 - x - y;
            if (z % 3 == 0 && 5 * x + 3 * y + z / 3 == 100)
                printf(" %2d: cock=%2d hen=%2d chicken=%2d\n", ++j, x, y, z);
        }
}
